; domain
(define (domain blockWorld)
    (:requirements :strips :typing)
    (:types block)
    (:predicates
        (on ?x - block ?y - block)
        (ontable ?x - block)
        (clear ?x - block)
        (handempty)
        (holding ?x - block))
    (:action pick-up
        ;;; action qui ramasse un bloc pose sur la table
        :parameters (?x - block)
        :precondition (and (clear ?x) (ontable ?x) (handempty))
        :effect (and (not (ontable ?x))
                (not (clear ?x))
                (not (handempty))
                (holding ?x)))
    (:action unstack
        ;;; action qui désempiler un bloc pose sur un autre bloc
        :parameters (?x - block ?y - block)
        :precondition (and (clear ?x) (on ?x ?y) (handempty))
        :effect (and (not (on ?x ?y))
                (not (clear ?x))
                (not (handempty))
                (holding ?x)
                (clear ?y)))
    (:action putdown
        ;;; action qui ramasse un bloc pose sur la table
        :parameters (?x - block)
        :precondition (holding ?x)
        :effect (and (not (holding ?x))
                (clear ?x)
                (ontable ?x)
                (handempty)))
    (:action stack
        ;;; action qui empiler un bloc sur un autre bloc
        :parameters (?x - block ?y - block)
        :precondition (and (clear ?y) (holding ?x))
        :effect (and (on ?x ?y)
                (clear ?x)
                (handempty)
                (not(holding ?x))
                (not(clear ?y))))
                   
)

; problem
(define (problem blockProblem)
	(:domain blockWorld)
	(:objects A B C D E F G H I J K L M N - block)
	(:init 
		;;; Première pile
		(clear B) (ontable C) (on B D) (on D H) (on H J) (on J I) (on I C) 
		;;; Deuxième pile		
		(clear F) (ontable A) (on F E) (on E A) 
		;;; Troisième pile
		(clear M) (ontable L) (on M K) (on K N) (on N L)
		;;; Mains vides		
		(handempty))
	(:goal (and (on A B) (on B C) (on C D) (on D E) (on E F) 
		(ontable F) (clear A) 
		(on H K) (on K L) (on L M) (on M N) (on N I) (on I J) 
		(ontable J) (clear H)		
		(handempty)))
)

; plan
1. (unstack m k)
   deleted: (on m k) (clear m) (handempty)
   added: (holding m) (clear k)
   goals met: 0 of 16
2. (putdown m)
   deleted: (holding m)
   added: (clear m) (ontable m) (handempty)
   goals met: 1 of 16
3. (unstack b d)
   deleted: (on b d) (clear b) (handempty)
   added: (holding b) (clear d)
   goals met: 0 of 16
4. (stack b m)
   deleted: (holding b) (clear m)
   added: (on b m) (clear b) (handempty)
   goals met: 1 of 16
5. (unstack f e)
   deleted: (on f e) (clear f) (handempty)
   added: (holding f) (clear e)
   goals met: 0 of 16
6. (putdown f)
   deleted: (holding f)
   added: (clear f) (ontable f) (handempty)
   goals met: 2 of 16
7. (unstack e a)
   deleted: (on e a) (clear e) (handempty)
   added: (holding e) (clear a)
   goals met: 2 of 16
8. (stack e f)
   deleted: (holding e) (clear f)
   added: (on e f) (clear e) (handempty)
   goals met: 4 of 16
9. (unstack d h)
   deleted: (on d h) (clear d) (handempty)
   added: (holding d) (clear h)
   goals met: 4 of 16
10. (stack d e)
   deleted: (holding d) (clear e)
   added: (on d e) (clear d) (handempty)
   goals met: 6 of 16
11. (unstack h j)
   deleted: (on h j) (clear h) (handempty)
   added: (holding h) (clear j)
   goals met: 4 of 16
12. (putdown h)
   deleted: (holding h)
   added: (clear h) (ontable h) (handempty)
   goals met: 6 of 16
13. (unstack j i)
   deleted: (on j i) (clear j) (handempty)
   added: (holding j) (clear i)
   goals met: 5 of 16
14. (putdown j)
   deleted: (holding j)
   added: (clear j) (ontable j) (handempty)
   goals met: 7 of 16
15. (unstack i c)
   deleted: (on i c) (clear i) (handempty)
   added: (holding i) (clear c)
   goals met: 6 of 16
16. (stack i j)
   deleted: (holding i) (clear j)
   added: (on i j) (clear i) (handempty)
   goals met: 8 of 16
17. (pick-up c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 7 of 16
18. (stack c d)
   deleted: (holding c) (clear d)
   added: (on c d) (clear c) (handempty)
   goals met: 9 of 16
19. (unstack b m)
   deleted: (on b m) (clear b) (handempty)
   added: (holding b) (clear m)
   goals met: 8 of 16
20. (stack b c)
   deleted: (holding b) (clear c)
   added: (on b c) (clear b) (handempty)
   goals met: 10 of 16
21. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 8 of 16
22. (stack a b)
   deleted: (holding a) (clear b)
   added: (on a b) (clear a) (handempty)
   goals met: 11 of 16
23. (unstack k n)
   deleted: (on k n) (clear k) (handempty)
   added: (holding k) (clear n)
   goals met: 10 of 16
24. (stack k h)
   deleted: (holding k) (clear h)
   added: (on k h) (clear k) (handempty)
   goals met: 10 of 16
25. (unstack n l)
   deleted: (on n l) (clear n) (handempty)
   added: (holding n) (clear l)
   goals met: 9 of 16
26. (stack n i)
   deleted: (holding n) (clear i)
   added: (on n i) (clear n) (handempty)
   goals met: 11 of 16
27. (pick-up m)
   deleted: (ontable m) (clear m) (handempty)
   added: (holding m)
   goals met: 10 of 16
28. (stack m n)
   deleted: (holding m) (clear n)
   added: (on m n) (clear m) (handempty)
   goals met: 12 of 16
29. (pick-up l)
   deleted: (ontable l) (clear l) (handempty)
   added: (holding l)
   goals met: 11 of 16
30. (stack l m)
   deleted: (holding l) (clear m)
   added: (on l m) (clear l) (handempty)
   goals met: 13 of 16
31. (unstack k h)
   deleted: (on k h) (clear k) (handempty)
   added: (holding k) (clear h)
   goals met: 13 of 16
32. (stack k l)
   deleted: (holding k) (clear l)
   added: (on k l) (clear k) (handempty)
   goals met: 15 of 16
33. (pick-up h)
   deleted: (ontable h) (clear h) (handempty)
   added: (holding h)
   goals met: 13 of 16
34. (stack h k)
   deleted: (holding h) (clear k)
   added: (on h k) (clear h) (handempty)
   goals met: 16 of 16
